Repository: sugc/MGCloud
Catalog: MGCloud/Resources/Language/*.lproj/Localizable.strings
Languages: de, es_419, ja

# 网络存储类型
source: Network Storage Type
de: Netzwerkspeichertyp
es_419: Tipo de almacenamiento en red
ja: ネットワークストレージタイプ

# 存储根目录
source: Storage Root Directory
de: Speicherwurzelverzeichnis
es_419: Directorio raíz de almacenamiento
ja: ストレージのルートディレクトリ

# 登录
source: Log In
de: Anmelden
es_419: Iniciar sesión
ja: ログイン

# 已登录
source: Logged In
de: Angemeldet
es_419: Sesión iniciada
ja: ログイン済み

# 保存
source: Save
de: Speichern
es_419: Guardar
ja: 保存

# 根目录不能为空
source: Root directory cannot be empty
de: Das Stammverzeichnis darf nicht leer sein
es_419: El directorio raíz no puede estar vacío
ja: ルートディレクトリは空白にできません

# 根目录必须为一级目录
source: Root directory must be a top-level directory
de: Das Stammverzeichnis muss ein Top-Level-Verzeichnis sein
es_419: El directorio raíz debe ser un directorio de nivel superior
ja: ルートディレクトリはトップレベルディレクトリである必要があります

# 根目录不合法，请重新输入
source: Invalid root directory, please re-enter
de: Ungültiges Stammverzeichnis, bitte erneut eingeben
es_419: Directorio raíz no válido, por favor, vuelva a ingresar
ja: 無効なルートディレクトリです。もう一度入力してください

# 请先登录授权
source: Please log in for authorization
de: Bitte zuerst einloggen und autorisieren
es_419: Por favor, inicie sesión para autorizar
ja: 認証のためにログインしてください

# 保存失败，请重试
source: Save failed, please try again
de: Speichern fehlgeschlagen, bitte versuchen Sie es erneut
es_419: Error al guardar, por favor, inténtelo de nuevo
ja: 保存に失敗しました。もう一度お試しください

# 保存成功
source: Save successful
de: Speichern erfolgreich
es_419: Guardado exitoso
ja: 保存に成功しました
